{
  "description": "ISO 13485 is a quality management standard for organizations that design and manufacture medical devices, ensuring compliance with regulatory requirements.",
  "questions": {
    "chapter 4: Quality management system": {
      "4.1: General requirements": [
        "Documentation covers the actions and roles of stakeholders enabling an effective QMS that meets standards and regulations.",
        "There are documented procedures and records for validation, modification, and re-validation of QMS software applications."
      ],
      "4.2: Documentation requirements": [
        "The documentation system meets all requirements and includes a manual, policy, and quality objectives ensuring effective process control.",
        "The quality manual specifies the scope, procedures, interaction between processes, and document structure."
      ]
    },
    "chapter 5: Management responsibility": {
      "5.1: Management commitment": [
        "Management is concretely committed to the effective functioning of the QMS."
      ],
      "5.2 and 5.3:": [
        "Compliance with requirements and the quality policy 'customer first' are understood and applied by everyone."
      ],
      "5.4: Planning": [
        "Measurable quality objectives are known by all and understood in their consistency with the quality policy.",
        "The QMS is planned, and if needed, modified in line with quality objectives."
      ],
      "5.5: Responsibility, authority and communication": [
        "Management defines, documents, and communicates roles, responsibilities, and authorities and ensures autonomy for tasks.",
        "Management ensures effective communication regarding the QMS."
      ],
      "5.6: Management review": [
        "Management conducts, records, and retains reviews on QMS performance and developments, following a documented procedure.",
        "The outputs from the Management Review are recorded and contribute to product, process, and QMS improvement."
      ]
    },
    "chapter 6: Resource management": {
      "6.1: Provision of resources": [
        "Resources required for the QMS are available and mobilized."
      ],
      "6.2: Human resources": [
        "Documents and records demonstrate that staff are competent, periodically trained, and aware of their impact on quality."
      ],
      "6.3: Infrastructure": [
        "Documents and records demonstrate that infrastructures and their maintenance are controlled to meet requirements."
      ],
      "6.4: Work environment and contamination control": [
        "Safety of all personnel, including temporary workers, their competencies, and work environment conditions are documented.",
        "Documents describe the control of contamination and its risks to personnel, products, and the environment."
      ]
    },
    "chapter 7: Product realization": {
      "7.1: Planning of product realization": [
        "Quality and risks related to product realization are anticipated, planned, documented, and recorded."
      ],
      "7.2: Customer-related processes": [
        "All explicit, implicit, regulatory, or use-related requirements for the product are determined.",
        "Communication with customers and regulatory authorities is planned and documented."
      ],
      "7.3: Design and development": [
        "The design and development process is documented, planned, reviewed, and validated, including the mobilization of required resources.",
        "The design and development file of a medical device includes records of compliance with requirements and control of modifications."
      ],
      "7.4: Purchasing": [
        "Supplier performance is periodically evaluated according to a documented procedure, and records are retained.",
        "Purchased products are appropriately verified and traceably recorded."
      ],
      "7.5: Production and service provision": [
        "Product conformity is ensured by controlled production and service provision, with traceability recorded, verified, and approved.",
        "Sterilization traceability of medical device batches is documented and retained."
      ],
      "7.6: Control of monitoring and measuring equipment": [
        "Monitoring and measuring activities and equipment follow documented procedures to ensure product conformity.",
        "The validity of monitoring and measuring results, and related software applications, is controlled per documented procedures with records retained."
      ]
    },
    "chapter 8: Measurement, analysis and improvement": {
      "8.1: General": [
        "QMS effectiveness and compliance are demonstrated through monitoring, measurement, analysis, and improvement processes."
      ],
      "8.2: Monitoring and measurement": [
        "QMS effectiveness is monitored using methods and documented procedures to collect and use customer feedback.",
        "Product conformity is periodically evaluated during realization, and evidence up to release is recorded and retained."
      ],
      "8.3: Control of non-conforming product": [
        "Non-conforming products are managed per documented procedures, and treatment results are recorded and retained.",
        "Product rework follows documented, reviewed, and approved procedures, with results recorded and retained."
      ],
      "8.4: Analysis of data": [
        "QMS effectiveness is based on data collected and analyzed per documented procedures, with results recorded and retained."
      ],
      "8.5: Improvement": [
        "Any useful change to QMS performance and medical device safety is identified and implemented.",
        "Preventive actions eliminate the causes of potential non-conformities per documented procedures, and results are recorded and retained."
      ]
    }
  }
}
